clc
clear
close all
data=load('prbsPhase.txt');
x=data(:,1);
N=length(x);
findi1=1;
%序列从一开始数，找到接近-180的数---------------------------------------------------------
while x(findi1)>-180%会不会某一个突变点一下子就调到条件里面呢？
%是不是一定会有这种负数出现呢？
    findi1=findi1+1;
end
%序列从一开始，若大于零，则减去360，考虑一开始有正数的情况，正的很小，不考虑它---------------------------------------------------------------------
x1=x;
for i=1:N
    if x1(i)>0
        if i<findi1&&x1(i)<90
            donothing=1;%序列一开始的正数不动它，这里都是假设数据都是有效的，没有异常点
        else
            x1(i)=x1(i)-360;
        end
    end
    
end
%第二次修正,找到一个序列开始的点，从负180度的点开始--------------------------------------------------
x2=x1;
for i=findi1:N
    if x2(i)>-50
        x2(i)=x2(i)-360;
    end
end

result(:,1)=x;
result(:,2)=x1;
result(:,3)=x2;
        